<a href="https://colab.research.google.com/github/Anoop-2752/PySpark/blob/main/PySpark_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### PySpark Handling Missing Vaues

- Dropping Columns
- Dropping Rows
- Various Parameters in Dropping Functionalities (any,how,thresh)
- Handling Missing Values by Mean,Median,Mode

### Filter Operations

- filter opeations
- &,==
- <==, >==
- ~ (inverse condition operation)

In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Basics').getOrCreate()

In [3]:
df_pyspark = spark.read.csv('Salary.csv',header=True,inferSchema=True)

In [4]:
df_pyspark.show()

+------+----+----------+------+
|  Name| age|Experience|Salary|
+------+----+----------+------+
|  John|  30|         8| 30000|
|   Sam|  25|         4| 25000|
|  Sara|  29|         2| 20000|
| Wayne|  35|        12| 35000|
|  Tony|  36|        15| 39000|
| Emily|  21|         1| 18000|
|Mahesh|NULL|      NULL| 40000|
|  NULL|  34|        10| 40000|
|  NULL|  36|      NULL|  NULL|
+------+----+----------+------+

In [5]:
df_pyspark.na.drop().show()   # parameters inside the drop features

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
| John| 30|         8| 30000|
|  Sam| 25|         4| 25000|
| Sara| 29|         2| 20000|
|Wayne| 35|        12| 35000|
| Tony| 36|        15| 39000|
|Emily| 21|         1| 18000|
+-----+---+----------+------+

In [7]:
# any==how
df_pyspark.na.drop(how='any').show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
| John| 30|         8| 30000|
|  Sam| 25|         4| 25000|
| Sara| 29|         2| 20000|
|Wayne| 35|        12| 35000|
| Tony| 36|        15| 39000|
|Emily| 21|         1| 18000|
+-----+---+----------+------+

In [9]:
# threshold
df_pyspark.na.drop(how='any',thresh=2).show()

+------+----+----------+------+
|  Name| age|Experience|Salary|
+------+----+----------+------+
|  John|  30|         8| 30000|
|   Sam|  25|         4| 25000|
|  Sara|  29|         2| 20000|
| Wayne|  35|        12| 35000|
|  Tony|  36|        15| 39000|
| Emily|  21|         1| 18000|
|Mahesh|NULL|      NULL| 40000|
|  NULL|  34|        10| 40000|
+------+----+----------+------+

In [11]:
# Subset  (wherever there are nan values in record that certain columns nan will be removed)
df_pyspark.na.drop(how='any',subset=['Age']).show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
| John| 30|         8| 30000|
|  Sam| 25|         4| 25000|
| Sara| 29|         2| 20000|
|Wayne| 35|        12| 35000|
| Tony| 36|        15| 39000|
|Emily| 21|         1| 18000|
| NULL| 34|        10| 40000|
| NULL| 36|      NULL|  NULL|
+-----+---+----------+------+

In [12]:
# Filling the missing values
df_pyspark.na.fill('Missing Values').show()

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|          John|  30|         8| 30000|
|           Sam|  25|         4| 25000|
|          Sara|  29|         2| 20000|
|         Wayne|  35|        12| 35000|
|          Tony|  36|        15| 39000|
|         Emily|  21|         1| 18000|
|        Mahesh|NULL|      NULL| 40000|
|Missing Values|  34|        10| 40000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [14]:
df_pyspark.na.fill('Missing Values','Name').show() #missing values in specific column

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|          John|  30|         8| 30000|
|           Sam|  25|         4| 25000|
|          Sara|  29|         2| 20000|
|         Wayne|  35|        12| 35000|
|          Tony|  36|        15| 39000|
|         Emily|  21|         1| 18000|
|        Mahesh|NULL|      NULL| 40000|
|Missing Values|  34|        10| 40000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [20]:
df_pyspark.show()

+------+----+----------+------+
|  Name| age|Experience|Salary|
+------+----+----------+------+
|  John|  30|         8| 30000|
|   Sam|  25|         4| 25000|
|  Sara|  29|         2| 20000|
| Wayne|  35|        12| 35000|
|  Tony|  36|        15| 39000|
| Emily|  21|         1| 18000|
|Mahesh|NULL|      NULL| 40000|
|  NULL|  34|        10| 40000|
|  NULL|  36|      NULL|  NULL|
+------+----+----------+------+

In [26]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['age','Experience','Salary']]
).setStrategy("mean")   # change by mean or median

In [27]:
# Add imputatio cols to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+------+----+----------+------+-----------+------------------+--------------+
|  Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+------+----+----------+------+-----------+------------------+--------------+
|  John|  30|         8| 30000|         30|                 8|         30000|
|   Sam|  25|         4| 25000|         25|                 4|         25000|
|  Sara|  29|         2| 20000|         29|                 2|         20000|
| Wayne|  35|        12| 35000|         35|                12|         35000|
|  Tony|  36|        15| 39000|         36|                15|         39000|
| Emily|  21|         1| 18000|         21|                 1|         18000|
|Mahesh|NULL|      NULL| 40000|         30|                 7|         40000|
|  NULL|  34|        10| 40000|         34|                10|         40000|
|  NULL|  36|      NULL|  NULL|         36|                 7|         30875|
+------+----+----------+------+-----------+------------------+--------------+

In [29]:
df_pyspark = imputer.fit(df_pyspark).transform(df_pyspark)

In [31]:
df_pyspark.show()

+------+----+----------+------+-----------+------------------+--------------+
|  Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+------+----+----------+------+-----------+------------------+--------------+
|  John|  30|         8| 30000|         30|                 8|         30000|
|   Sam|  25|         4| 25000|         25|                 4|         25000|
|  Sara|  29|         2| 20000|         29|                 2|         20000|
| Wayne|  35|        12| 35000|         35|                12|         35000|
|  Tony|  36|        15| 39000|         36|                15|         39000|
| Emily|  21|         1| 18000|         21|                 1|         18000|
|Mahesh|NULL|      NULL| 40000|         30|                 7|         40000|
|  NULL|  34|        10| 40000|         34|                10|         40000|
|  NULL|  36|      NULL|  NULL|         36|                 7|         30875|
+------+----+----------+------+-----------+------------------+--------------+

## Filter operation

In [34]:
af_pyspark = spark.read.csv('Salary1.csv',header=True,inferSchema=True)

In [36]:
af_pyspark.show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
| John| 30|         8| 30000|
|  Sam| 25|         4| 25000|
| Sara| 29|         2| 20000|
|Wayne| 35|        12| 35000|
| Tony| 36|        15| 39000|
|Emily| 21|         1| 18000|
+-----+---+----------+------+

In [39]:
# Salary of people less than or equal to 20000
af_pyspark.filter('Salary<=25000').show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|  Sam| 25|         4| 25000|
| Sara| 29|         2| 20000|
|Emily| 21|         1| 18000|
+-----+---+----------+------+

In [40]:
af_pyspark.filter('Salary<=25000').select(['Name','age']).show()

+-----+---+
| Name|age|
+-----+---+
|  Sam| 25|
| Sara| 29|
|Emily| 21|
+-----+---+

In [41]:
af_pyspark.filter(af_pyspark['Salary']<=25000).show() # conditional Statements

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|  Sam| 25|         4| 25000|
| Sara| 29|         2| 20000|
|Emily| 21|         1| 18000|
+-----+---+----------+------+

In [44]:
af_pyspark.filter((af_pyspark['Salary']<=20000) &
                 (af_pyspark['Salary']>=15000)).show()  # Mulpiple conditional statements

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
| Sara| 29|         2| 20000|
|Emily| 21|         1| 18000|
+-----+---+----------+------+

In [45]:
# inverse condition operation (~)
af_pyspark.filter(~(af_pyspark['Salary']<=25000)).show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
| John| 30|         8| 30000|
|Wayne| 35|        12| 35000|
| Tony| 36|        15| 39000|
+-----+---+----------+------+